# 2021 Olympics in Tokyo

Details
This contains the details of over 11,000 athletes, with 47 disciplines, along with 743 Teams taking part in the 2021(2020) Tokyo Olympics.
This dataset contains the details of the Athletes, Coaches, Teams participating as well as the Entries by gender. It contains their names, countries represented, discipline, gender of competitors, name of the coaches.

Will update the dataset with medals(gold, silver, bronze), more details about the athletes after few weeks.

Credits
Source: Tokyo Olympics 2020 Website

### Christian Jay Baguio
#### DS3A

# Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

# Load Datasets

In [2]:
athletes = pd.read_excel('Athletes.xlsx')
coach = pd.read_excel('Coaches.xlsx')
medal = pd.read_excel('Medals.xlsx')
gender = pd.read_excel('EntriesGender.xlsx')
team = pd.read_excel('Teams.xlsx')

C:\Users\ATARA\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")
C:\Users\ATARA\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [3]:
athletes.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

The Dataframe head() is a code that returns the first 5 rows of the dataset that is being read. It is useful in terms of you want to lessen the load time of your data and want to just quickly check the attributes of the dataset.

In [4]:
athletes.tail()

                        Name      NOC    Discipline
11080  ZWICKER Martin Detlef  Germany        Hockey
11081      ZWOLINSKA Klaudia   Poland  Canoe Slalom
11082           ZYKOVA Yulia      ROC      Shooting
11083      ZYUZINA Ekaterina      ROC       Sailing
11084        ZYZANSKA Sylwia   Poland       Archery

The Dataframe tail() is opposite to head, This code returns the last 5 rows of the dataset that is being read. In terms of using the tail it is useful on checking the total amount of rows and also a good fit in checking if you do some sorting or appending and want to check if it is correct or not.

In [5]:
coach.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 394 entries, 0 to 393
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        394 non-null    object
 1   NOC         394 non-null    object
 2   Discipline  394 non-null    object
 3   Event       249 non-null    object
dtypes: object(4)
memory usage: 12.4+ KB

The Dataframe info() is a function code that checks the attributes of the dataset, sum values of each attributes, and their datatypes.

In [6]:
coach.head()

              Name            NOC  Discipline Event
0  ABDELMAGID Wael          Egypt    Football   NaN
1        ABE Junya          Japan  Volleyball   NaN
2    ABE Katsuhiko          Japan  Basketball   NaN
3     ADAMA Cherif  Côte d'Ivoire    Football   NaN
4       AGEBA Yuya          Japan  Volleyball   NaN

The Dataframe head() is a code that returns the first 5 rows of the dataset that is being read. It also read an attribute that consist of NaN(Not a Number) values.

In [7]:
print(medal.describe())

            Rank       Gold     Silver     Bronze       Total  Rank by Total
count  93.000000  93.000000  93.000000  93.000000   93.000000      93.000000
mean   46.333333   3.655914   3.634409   4.322581   11.612903      43.494624
std    26.219116   7.022471   6.626339   6.210372   19.091332      24.171769
min     1.000000   0.000000   0.000000   0.000000    1.000000       1.000000
25%    24.000000   0.000000   0.000000   1.000000    2.000000      23.000000
50%    46.000000   1.000000   1.000000   2.000000    4.000000      47.000000
75%    70.000000   3.000000   4.000000   5.000000   11.000000      66.000000
max    86.000000  39.000000  41.000000  33.000000  113.000000      77.000000

The Dataframe describe() is a function code that gets a descriptive statistics summary of a given dataframe. This includes count, mean, std deviation, min-max values, and percentiles of all the features.

In [8]:
print('*'*70)

**********************************************************************

This code means that a star sign is being multiplied by 70 and after execute it prints 70 star sign.

In [11]:
print(medal.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           93 non-null     int64
 1   Team/NOC       93 non-null     object
 2   Gold           93 non-null     int64
 3   Silver         93 non-null     int64
 4   Bronze         93 non-null     int64
 5   Total          93 non-null     int64
 6   Rank by Total  93 non-null     int64
dtypes: int64(6), object(1)
memory usage: 5.2+ KB

The Dataframe info() is a function code that checks the attributes of the dataset, sum values of each attributes, and their datatypes.

Out of 7 columns there are only 1 object type of data and the rest is integer.